<?php

return [
    'CLIQUES' => [
        1 => '村人陣営',
        2 => '人狼陣営',
    ],
    'SPECIES' => [
        1 => '人',
        2 => '狼',
    ],
    'SKILLS' => [
        /**
         * id,
         * cliques, species,
         * can_raid, can_divine, can_dissect, can_escort,
         * symbol, name
         * ]
         */
        [1, 1, 1, 0, 0, 0, 0, '村', '村人'],
        [2, 2, 2, 1, 0, 0, 0, '狼', '人狼'],
        [3, 1, 1, 0, 1, 0, 0, '占', '占い師'],
        [4, 1, 1, 0, 0, 1, 0, '霊', '霊能者'],
        [5, 1, 1, 0, 0, 0, 1, '狩', '狩人'],
        [6, 2, 1, 0, 0, 0, 0, '狂', '狂人'],
    ],
    'STRUCTURES' => [
        1 => [
            'name' => '牛村',
            4 => '村狼占狂',
            5 => '村村狼占狂',
            6 => '村村村狼占狂',
            7 => '村村村村狼占狂',
            8 => '村村村村狼狼占狩',
            9 => '村村村村村狼狼占狩',
            10 => '村村村村狼狼占霊狂狩',
            11 => '村村村村村狼狼占霊狂狩',
            12 => '村村村村村村狼狼占霊狂狩',
            13 => '村村村村村村村狼狼占霊狂狩',
            14 => '村村村村村村村村狼狼占霊狂狩',
            15 => '村村村村村村村村村狼狼占霊狂狩',
            16 => '村村村村村村村狼狼狼占霊狂狩共共',
            17 => '村村村村村村村村狼狼狼占霊狂狩共共',
            18 => '村村村村村村村村村狼狼狼占霊狂狩共共',
            19 => '村村村村村村村村村村狼狼狼占霊狂狩共共',
            20 => '村村村村村村村村村村村狼狼狼占霊狂狩共共',
            21 => '村村村村村村村村村村村村狼狼狼占霊狂狩共共',
            22 => '村村村村村村村村村村村村村狼狼狼占霊狂狩共共',
        ],
    ],
];
